In [70]:
import pandas as pd
import seaborn as sns

In [71]:
book_sales =pd.read_csv("book_sales.csv")

In [72]:
book_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       30 non-null     object
 1   Paperback  30 non-null     int64
 2   Hardcover  30 non-null     int64
dtypes: int64(2), object(1)
memory usage: 848.0+ bytes

In [73]:
book_sales.head()

         Date  Paperback  Hardcover
0  2000-04-01        199        139
1  2000-04-02        172        128
2  2000-04-03        111        172
3  2000-04-04        209        139
4  2000-04-05        161        191

In [74]:
book_sales.tail()

          Date  Paperback  Hardcover
25  2000-04-26        182        200
26  2000-04-27        222        201
27  2000-04-28        217        283
28  2000-04-29        188        220
29  2000-04-30        247        259

In [75]:
book_sales.shape

(30, 3)

# Normalization / MinMaxScaler

In [76]:
#normalization step
#import
#creat obj and value for MinMaxScaler 
#fit
# transform the data

In [77]:
from sklearn.preprocessing import MinMaxScaler

In [78]:
normalization_value = MinMaxScaler(feature_range=(1,2))

In [79]:
normalization_fit = normalization_value.fit(book_sales[["Paperback"]])

In [80]:
book_sales.head(8)

         Date  Paperback  Hardcover
0  2000-04-01        199        139
1  2000-04-02        172        128
2  2000-04-03        111        172
3  2000-04-04        209        139
4  2000-04-05        161        191
5  2000-04-06        119        168
6  2000-04-07        195        170
7  2000-04-08        195        145

In [81]:
book_sales['Paperback'] = normalization_value.transform(book_sales[['Paperback']])

In [82]:
book_sales.head(8)

         Date  Paperback  Hardcover
0  2000-04-01   1.647059        139
1  2000-04-02   1.448529        128
2  2000-04-03   1.000000        172
3  2000-04-04   1.720588        139
4  2000-04-05   1.367647        191
5  2000-04-06   1.058824        168
6  2000-04-07   1.617647        170
7  2000-04-08   1.617647        145

In [83]:
# fit and transforn together
book_sales['Hardcover'] = normalization_value.fit_transform(book_sales[['Hardcover']])

In [84]:
book_sales.head()

         Date  Paperback  Hardcover
0  2000-04-01   1.647059   1.070968
1  2000-04-02   1.448529   1.000000
2  2000-04-03   1.000000   1.283871
3  2000-04-04   1.720588   1.070968
4  2000-04-05   1.367647   1.406452

# Standard Scaler / Standardization

In [85]:
book_sales2 = pd.read_csv('book_sales.csv')

In [86]:
from sklearn.preprocessing import StandardScaler

In [87]:
standardization_value = StandardScaler()

In [88]:
book_sales2['Paperback'] = standardization_value.fit_transform(book_sales2[["Paperback"]])

In [89]:
book_sales2['Hardcover'] = standardization_value.fit_transform(book_sales2[["Hardcover"]])

In [90]:
book_sales2.head(8)

         Date  Paperback  Hardcover
0  2000-04-01   0.361195  -1.510022
1  2000-04-02  -0.412794  -1.787631
2  2000-04-03  -2.161438  -0.677197
3  2000-04-04   0.647858  -1.510022
4  2000-04-05  -0.728124  -0.197691
5  2000-04-06  -1.932107  -0.778145
6  2000-04-07   0.246530  -0.727671
7  2000-04-08   0.246530  -1.358600

# Robust Scaler

In [91]:
book_sales3 = pd.read_csv('book_sales.csv')

In [92]:
from sklearn.preprocessing import RobustScaler

In [93]:
robustscaler_value = RobustScaler()

In [94]:
book_sales3['Paperback'] = robustscaler_value.fit_transform(book_sales3[['Paperback']])

In [95]:
book_sales3['Hardcover'] = robustscaler_value.fit_transform(book_sales3[['Hardcover']])

In [96]:
book_sales3.head(8)

         Date  Paperback  Hardcover
0  2000-04-01      0.250  -1.194175
1  2000-04-02     -0.425  -1.407767
2  2000-04-03     -1.950  -0.553398
3  2000-04-04      0.500  -1.194175
4  2000-04-05     -0.700  -0.184466
5  2000-04-06     -1.750  -0.631068
6  2000-04-07      0.150  -0.592233
7  2000-04-08      0.150  -1.077670

# Max Absolute Scaler

In [97]:
book_sales4 = pd.read_csv('book_sales.csv')

In [98]:
from sklearn.preprocessing import MaxAbsScaler

In [99]:
MaxAbsScaler_value = MaxAbsScaler()

In [100]:
book_sales4['Paperback'] = MaxAbsScaler_value.fit_transform(book_sales4[['Paperback']])

In [102]:
book_sales4['Hardcover'] = MaxAbsScaler_value.fit_transform(book_sales4[['Hardcover']])

In [103]:
book_sales4.head(8)

         Date  Paperback  Hardcover
0  2000-04-01   0.805668   0.491166
1  2000-04-02   0.696356   0.452297
2  2000-04-03   0.449393   0.607774
3  2000-04-04   0.846154   0.491166
4  2000-04-05   0.651822   0.674912
5  2000-04-06   0.481781   0.593640
6  2000-04-07   0.789474   0.600707
7  2000-04-08   0.789474   0.512367

In [104]:
book_sales4.tail(8)

          Date  Paperback  Hardcover
22  2000-04-23   0.939271   0.840989
23  2000-04-24   0.789474   0.848057
24  2000-04-25   0.769231   0.756184
25  2000-04-26   0.736842   0.706714
26  2000-04-27   0.898785   0.710247
27  2000-04-28   0.878543   1.000000
28  2000-04-29   0.761134   0.777385
29  2000-04-30   1.000000   0.915194